Revit 2027 API
Transform1D.GetInverse Method
 Gets the inverse transformation of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform1D GetInverse()
Public Function GetInverse As Transform1D
public:
Transform1D^ GetInverse()
member GetInverse : unit -> Transform1D
Return Value
Transform1D
Exceptions
Exception | Condition
InvalidOperationException |  This transformation is singular.
Remarks
 The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace